# How to Replace Values in Column Based On Another DataFrame in Pandas

In [1]:
import pandas as pd

df = pd.read_csv(f'../data/earthquakes_1965_2016_database.csv.zip', dtype=str)
cols = ['Date', 'Time', 'Latitude', 'Longitude', 'Depth', 'Magnitude Type']
df = df[cols]
df = df.tail(7)
df

             Date      Time Latitude  Longitude  Depth Magnitude Type
23405  12/27/2016  23:20:56  45.7192     26.523     97            MWW
23406  12/28/2016  08:18:01  38.3754  -118.8977   10.8             ML
23407  12/28/2016  08:22:12  38.3917  -118.8941   12.3             ML
23408  12/28/2016  09:13:47  38.3777  -118.8957    8.8             ML
23409  12/28/2016  12:38:51  36.9179   140.4262     10            MWW
23410  12/29/2016  22:30:19  -9.0283   118.6639     79            MWW
23411  12/30/2016  20:08:28  37.3973   141.4103  11.94             MB

In [2]:
import pyperclip

pyperclip.copy((df.head().to_html(classes='table table-striped text-center', justify='center', index=False)))

## Replace single character in Pandas Column with .str.replace

In [3]:
df['Depth'].str.replace('.',',')

/tmp/ipykernel_27767/4235268408.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Depth'].str.replace('.',',')

23405       97
23406     10,8
23407     12,3
23408      8,8
23409       10
23410       79
23411    11,94
Name: Depth, dtype: object

In [4]:
df['Depth'].str.replace('.',',', regex= True)

23405       97
23406     10,8
23407     12,3
23408      8,8
23409       10
23410       79
23411    11,94
Name: Depth, dtype: object

## Replace regex pattern in Pandas Column

In [5]:
df['Date'].str.replace(r'(\d{2})/(\d{2})/(\d{4})', r"\3-\2-\1", regex=True)

23405    2016-27-12
23406    2016-28-12
23407    2016-28-12
23408    2016-28-12
23409    2016-28-12
23410    2016-29-12
23411    2016-30-12
Name: Date, dtype: object

In [6]:
df['Date'].str.replace(r'(\d{2})/(\d{2})/\d{2}(\d{2})', r"\2 \1 '\3", regex=True)

23405    27 12 '16
23406    28 12 '16
23407    28 12 '16
23408    28 12 '16
23409    28 12 '16
23410    29 12 '16
23411    30 12 '16
Name: Date, dtype: object

## Replace text in whole DataFrame

In [7]:
df.replace('.',',')

             Date      Time Latitude  Longitude  Depth Magnitude Type
23405  12/27/2016  23:20:56  45.7192     26.523     97            MWW
23406  12/28/2016  08:18:01  38.3754  -118.8977   10.8             ML
23407  12/28/2016  08:22:12  38.3917  -118.8941   12.3             ML
23408  12/28/2016  09:13:47  38.3777  -118.8957    8.8             ML
23409  12/28/2016  12:38:51  36.9179   140.4262     10            MWW
23410  12/29/2016  22:30:19  -9.0283   118.6639     79            MWW
23411  12/30/2016  20:08:28  37.3973   141.4103  11.94             MB

In [8]:
df.replace('\.',',', regex=True)

             Date      Time Latitude  Longitude  Depth Magnitude Type
23405  12/27/2016  23:20:56  45,7192     26,523     97            MWW
23406  12/28/2016  08:18:01  38,3754  -118,8977   10,8             ML
23407  12/28/2016  08:22:12  38,3917  -118,8941   12,3             ML
23408  12/28/2016  09:13:47  38,3777  -118,8957    8,8             ML
23409  12/28/2016  12:38:51  36,9179   140,4262     10            MWW
23410  12/29/2016  22:30:19  -9,0283   118,6639     79            MWW
23411  12/30/2016  20:08:28  37,3973   141,4103  11,94             MB

## Replace text with conditions in Pandas with lambda and .apply/.applymap

In [9]:
df['Date'].apply(lambda x: x.replace('/', '-'))

23405    12-27-2016
23406    12-28-2016
23407    12-28-2016
23408    12-28-2016
23409    12-28-2016
23410    12-29-2016
23411    12-30-2016
Name: Date, dtype: object

In [10]:
df.applymap(lambda x: x.replace('/', '-'))

             Date      Time Latitude  Longitude  Depth Magnitude Type
23405  12-27-2016  23:20:56  45.7192     26.523     97            MWW
23406  12-28-2016  08:18:01  38.3754  -118.8977   10.8             ML
23407  12-28-2016  08:22:12  38.3917  -118.8941   12.3             ML
23408  12-28-2016  09:13:47  38.3777  -118.8957    8.8             ML
23409  12-28-2016  12:38:51  36.9179   140.4262     10            MWW
23410  12-29-2016  22:30:19  -9.0283   118.6639     79            MWW
23411  12-30-2016  20:08:28  37.3973   141.4103  11.94             MB

In [11]:
df['Date'].apply(lambda x: x.replace('/', '-') if '20' in x else x)

23405    12-27-2016
23406    12-28-2016
23407    12-28-2016
23408    12-28-2016
23409    12-28-2016
23410    12-29-2016
23411    12-30-2016
Name: Date, dtype: object